app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "amet"], ["created_at", "2016-09-01 03:04:17.981144"], ["updated_at", "2016-09-01 03:04:17.981144"]]
---
  def create
    @artist = Artist.new(artist_params)

    if @artist.save